fn main() {
    let arr1: [i32; 5] = [10, 20, 30 ,40, 50];
    let arr2 = ["test1", "test2", "test3"];

    println!("Элементов в массиве {}", arr1.len()); // кол-во элементов arr1

    let var1 = arr2[0]; // берем массив по индексу
    let var2 = arr2[1]; // берем массив по индексу
    println!("{var1} {var2}"); //
   
    let mut arr3 = ["test01", "test002", "test3"];
    println!("{} {} {}",arr3[0], arr3[1], arr3[2]); //
    arr3[1] = "TEST"; // перезаписываем элемент массива
    println!("{} {} {}",arr3[0], arr3[1], arr3[2]); //

    //Debug Trait
    println!("{:?}",arr3); // вывод содержимого массива
    println!("{arr3:?}");  // вывод содержимого массива альтернативный синтаксис
    println!("{arr3:#?}"); // более читаемый вариант с переносом строки

    // Макрос dbg!() может быть удобней Debug Trait
    dbg!(arr3);
}
